tutorials/catchyMultiphaseEulerFoam/packedBedValidation/isothermalSegregated/0.org/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    outlet
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    walls
    {
        type               fixedValue;
        value              uniform (0 0 0);
    }
    wedge
    {
        type               wedge;
    }
}

// ************************************************************************* //
